import museum from "@/assets/yojna-images/ram-naam-museum.webp";
import gaushala from "@/assets/yojna-images/ram-naam-gaushala-hospital.webp";
import oldagehome from "@/assets/yojna-images/ram-ashray-old-age-home.webp";
import ghat from "@/assets/yojna-images/ram-naam-ghat-temple.webp";
import annakshetra from "@/assets/yojna-images/ram-annakshetra.webp";
import education from "@/assets/yojna-images/ram-vidya-dhan-yojana.webp";
import plantation from "@/assets/yojna-images/tree-plantation-abhiyan.webp";
import ganga_campaign from "@/assets/yojna-images/ganga-pollution-free-abhiyan.webp";
import medical_camp from "@/assets/yojna-images/medical-health-camp.webp";
import moksha_dham from "@/assets/yojna-images/moksha-dham-cremation.webp";

export interface Yojana {
    slug: string;
    title: string;
    image: string;
    desc: JSX.Element;
}

export const yojanas: Yojana[] = [
    {
        slug: "shri-ram-naam-sangrahalaya",
        title: "1. श्रीराम नाम संग्राहलय",
        image: museum,
        desc: (
            <div className="space-y-4 text-justify text-lg leading-relaxed text-muted-foreground font-hind">
                <p>
                    श्रीराम नाम विश्व बैंक समिति "राम नाम" सेवा क्षेत्र में विश्व की सबसे अग्रणी संस्था है। जहां प्रतिदिन पूरे भारत से करोड़ों की संख्या में श्रीराम नाम की कापी फॉर्म और राम नाम की नामों का लेन देन होता है। अर्थात् संस्था खाली पुस्तकें लोगों को लिखने के लिए निःशुल्क देती है और सभी लोग बडी संख्या में भावान का नाम कापी किताबों में लिखकर संस्था में जमा करवाते है। इसी प्रकार यह क्रम निरंतर चलता रहता है।
                </p>
                <p>
                    संस्था श्रीराम नाम विश्व बैंक समिति लोगों द्वारा जमा किए गए भगवान के नामों को बड़ी ही सुन्दर तरीके से संग्रह करने का काम करती है। सर्वप्रथम लोगों के खाते खोले जाते हैं। ताकि उनके द्वारा लिखे गए नामों को उनके ही खाते में जमा किया जा सके। जिनकी पासबुक उन्हें दी जाती है तथा बड़ी मात्रा में यदि आप बड़ी मात्रा में नाम जमा करवाते है। तो उसका एक प्रमाण पत्र भी आपको दिया जाता है। फिर आपके द्वारा लिखे गए राम नाम को संस्था में आपके नाम से संग्रह किया जाता है। जिसके फलस्वरूप आज संस्था के पास कई लाख करोड हस्तलिखित राम नाम मतलब अंसंख्य मात्रा में राम नाम धन एकत्रित है।
                </p>
                <p>
                    जिसको व्यवस्थित एवं भव्य स्वरूप देने के लिए संस्था द्वारा विश्व का सबसे दिव्य एवं अदभुत "श्री राम नाम संग्राहलय"बनाया जा रहा है। जिस महान कार्य में आप सहयोग कर अपनी महत्वपूर्ण भूमिका दर्ज करवा सकते है। कृपया इस राम काज से अवश्य जुड़ें।
                </p>
                <div className="font-bold text-primary pt-2">
                    <p>इस पुनीत कार्य में सहयोग करें व अधिक जानकारी के लिए हमसे सम्पर्क करें।</p>
                    <p>Website : shreeramnaambank.com / Email: raamnaambank@gmail.com</p>
                    <p>Mob: 9045000108 / 8868888601 / 9410110900 / 8267006782</p>
                </div>
            </div>
        ),
    },
    {
        slug: "shri-ram-naam-gaushala-hospital",
        title: "2. श्री राम नाम गौशाला एवं अस्पताल",
        image: gaushala,
        desc: (
            <div className="space-y-4 text-justify text-lg leading-relaxed text-muted-foreground font-hind">
                <p>
                    श्री राम नाम विश्व बैंक समिति विगत 20 वर्षों से गौ सेवा एवं निराश्रित गायों की देखभाल करती आ रही है। साथ ही जो जानवर गाय इत्यादि किसी दुर्घटना में घायल हो जाते है। उनका उपचार करने व करवाने का कार्य करती है।
                </p>
                <p>
                    बेसहारा, निराश्रित एवं घायल गौमाताऔ के लिए संस्था अब लगभग 20 बीघा भूमि लेने जा रही है। जिसमे एक विशाल गौशाला एवं पशु अस्पताल का निर्माण किया जाएगा। जिसमें आपके महत्वपूर्ण सहयोग की अति आवश्यकता है। कृपा कर इस पुण्य कार्य में अपना सहयोग जरूर प्रदान करें।
                </p>
                <p>
                    गौमाता के लिए खाने के लिए चारे, चोकर, खल, आदि, मेडिकल में दवाईयां, पट्टी, रुई, रहने के लिए टीन शेड, बांस बल्लियां, पंखे लाइट, आदि सेवा कार्यों में आप जरूर सहयोग करें।
                </p>
                <div className="font-bold text-primary pt-2">
                    <p>इस पुनीत कार्य में सहयोग करें व अधिक जानकारी के लिए हमसे सम्पर्क करें।</p>
                    <p>Website : shreeramnaambank.com / Email : raamnaambank@gmail.com</p>
                    <p>Mob: 9045000108 / 8868888601 / 9410110900 / 8267006782</p>
                </div>
            </div>
        ),
    },
    {
        slug: "shri-ram-ashray-old-age-home",
        title: "3. श्रीराम आश्रय (ओल्ड एज होम)",
        image: oldagehome,
        desc: (
            <div className="space-y-4 text-justify text-lg leading-relaxed text-muted-foreground font-hind">
                <p>
                    श्री राम नाम विश्व बैंक समिति अपनी संस्था से जुड़े हुए लोगों के लिए बहुत ही सुन्दर और मनभावन वातावरण में एक ओल्ड एज होम तैयार करने जा रही है। जोकि एक अलग ही दुनिया होगी। यह लगभग 2 साल के भीतर तैयार हो जायेगा। जिसमें स्वच्छ हवादार कमरे, बाथरूम, टॉयलेट, लॉबी, बालाकनी, रसोई, सुंदर पार्क, सुबह और रात का 2 समय का खाना, सुबह शाम चाय नाश्ता, मेडिकल सुविधा, गंगा मैया के पावन तट का किनारा यानी गंगा जी में नजदीक, आदि बहुत सी सुविधाएं आपको मिलेगी।
                </p>
                <div>
                    <h4 className="font-bold mb-2">श्री राम आश्रय में मिलने वाली सविधाएँ।</h4>
                    <ul className="list-disc list-inside space-y-1 pl-2">
                        <li>दोपहर और रात्रि का भोजन</li>
                        <li>सुबह और शाम का चाय नाश्ता</li>
                        <li>शान्त और स्वच्छ वातावरण</li>
                        <li>सुंदर पार्क</li>
                        <li>श्रीराम नाम संकीर्तन और धार्मिक कार्य</li>
                        <li>गंगा आरती</li>
                        <li>मेडिकल फैसिलिटी</li>
                        <li>हरकी पौडी से मात्र 15 मिनट की दूरी पर</li>
                    </ul>
                </div>
                <div className="font-bold text-primary pt-2">
                    <p>इस पुनीत कार्य में सहयोग करें व अधिक जानकारी के लिए हमसे सम्पर्क करें।</p>
                    <p>Website : shreeramnaambank.com / Email : raamnaambank@gmail.com</p>
                    <p>Mob: 9045000108 / 8868888601 / 9410110900 / 8267006782</p>
                </div>
            </div>
        ),
    },
    {
        slug: "shri-ram-naam-ghat-temple",
        title: "4. श्री राम नाम घाट एवं मंदिर निर्माण",
        image: ghat,
        desc: (
            <div className="space-y-4 text-justify text-lg leading-relaxed text-muted-foreground font-hind">
                <p>
                    श्री राम नाम विश्व बैंक समिति का हरिद्वार के गंगातट पर एक बहुत सुंदर घाट बना हुआ है। जहां प्रतिदिन और विशेषकर पड़ने वाले स्नान पर्वों पर हवन यज्ञ, रुद्राभिषेक, गंगा आरती, भण्डारे, भागवद् कथा, संकीर्तन आदि धार्मिक कार्यों का आयोजन किया जाता हैं।
                </p>
                <p>
                    हरिद्वार में गंगा किनारे स्थित यह घाट (लगभग 102 मी. क्षेत्र में बना हुआ है। जहां का सौंदर्यीकरण, टीन शेड, मंदिर निर्माण, गंगा आरती का स्टेज आदि बहुत से कार्य किए जाने है। आप भी यहीं आकर गंगा आरती धार्मिक अनुष्ठान भोजन/भंडारे आदि कार्यों में प्रतिभाग/सहयोग कर पुण्य को भागी बन सकते हैं। घाट के सौन्दर्यकरण, मदिर निर्माण में आप भी अपना महत्वपूर्ण योगदान दे सकते हैं।
                </p>
                <div className="font-bold text-primary pt-2">
                    <p>इस पुनीत कार्य में सहयोग करें व अधिक जानकारी के लिए हमसे सम्पर्क करें।</p>
                    <p>Website : shreeramnaambank.com / Email : raamnaambank@gmail.com</p>
                    <p>Mob: 9045000108 / 8868888601 / 9410110900 / 8267006782</p>
                </div>
            </div>
        ),
    },
    {
        slug: "shri-ram-annakshetra",
        title: "5. श्रीराम अनक्षेत्र",
        image: annakshetra,
        desc: (
            <div className="space-y-4 text-justify text-lg leading-relaxed text-muted-foreground font-hind">
                <p>
                    हरिद्वार में अक्सर होने वाले विशेष स्नान पर्वों पर श्री राम नाम बैंक समिति द्वारा गंगा तट पर भोजन भण्डारे का आयोजन किया जाता है। जिसमें बड़ी संख्या में संत महात्मा, सामाजिक जन, दूर दूर से आए तीर्थ श्रद्धालु जन सामाजिक लोग आकर प्रसाद ग्रहण करते हैं।
                </p>
                <p>
                    आप भी इस पावन पुनीत कार्य में सहयोग प्रदान कर सकते है।
                </p>
                <p>
                    विशेषकर आप भी अपनी की याद में, अपने प्रियजनों को निमित्त, या अपने जन्मदिन, वैवाहिक वर्षगांठ और किसी भी शुभ अवसर पर संस्था के सहयोग से भण्डारा करवाना चाहते हैं। तो करवा सकते हैं।
                </p>
                <div className="font-bold text-primary pt-2">
                    <p>इस पुनीत कार्य में सहयोग करें व अधिक जानकारी के लिए हमसे सम्पर्क करें।</p>
                    <p>Website : shreeramnaambank.com / Email : raamnaambank@gmail.com</p>
                    <p>Mob: 9045000108 / 8868888601 / 9410110900 / 8267006782</p>
                </div>
            </div>
        ),
    },
    {
        slug: "education-distribution",
        title: "6. शिक्षा के क्षेत्र में सहयोग",
        image: education,
        desc: (
            <div className="space-y-4 text-justify text-lg leading-relaxed text-muted-foreground font-hind">
                <p>
                    श्री राम नाम विश्व बैंक समिति प्रतिभावान गरीब, बेसहारा एवं निराश्रित छात्र एवं छात्राओं को निःशुल्क -पाठ्य सामग्री व कोर्स से सम्बंधित किताबें कॉपियां या उनकी स्कून कोलेज की फीस देने में सहयोग करती है। जिन बच्चों में पढाई का हुनर होता है। तो उन बच्चों की प्रतिभा को निखारने के लिए संस्था अपना महत्वपूर्ण सहयोग प्रदान करती है। विगत 15 वर्षों से संस्था अपनी सामर्थ्यनुसार जरूरतमंदों को सहयोग करने का कार्य करती आ रही है। इस महत्वपूर्ण कार्य में आप भी बच्चों की स्कूली शिक्षा व पढ़ाई के खर्च को वहन कर उनकी मदद कर सकते है। जरूरतमंदों को सहयोग प्रदान कर सकते हैं।
                </p>
                <div className="font-bold text-primary pt-2">
                    <p>इस पुनीत कार्य में सहयोग करें व अधिक जानकारी के लिए हमसे सम्पर्क करें।</p>
                    <p>Website : shreeramnaambank.com / Email : raamnaambank@gmail.com</p>
                    <p>Mob: 9045000108 / 8868888601 / 9410110900 / 8267006782</p>
                </div>
            </div>
        ),
    },
    {
        slug: "tree-plantation",
        title: "7. पर्यावरण क्षेत्र में सहयोग",
        image: plantation,
        desc: (
            <div className="space-y-4 text-justify text-lg leading-relaxed text-muted-foreground font-hind">
                <p>
                    श्री राम नाम विश्व बैंक समिति विगत 30 वर्षों से पर्यावरण सह‌योग के लिए बड़े स्तर पर वृक्षारोपण महाभियान चलाती आ रही है। जिसमे लाखों लोगों की सहायता से अब तक लाखों पेड़ लगाए जा चुके है। संस्था द्वारा प्रतिवर्ष वृक्षारोपण का आयोजन किया जाता है। जितने वृक्ष और पौधे प्रतिवर्ष लगाए जाते हैं। उन्हे संस्था के पदाधिकारियों या संस्था के सदस्यों के माध्यम से गोद लिया जाता है तथा उनका तब तक पालन पोषण किया जाता है। जब तक वह बडे न हो जाए।
                </p>
                <p>
                    आप भी स्वयं या अपनों की याद में अपने जन्मदिवस, वैवाहिक वर्षगांठ या किसी खुशी के अवसर पर वृक्षारोपण करवा सकते हैं। या एक पौधे को गोद ले सकते हैं।
                </p>
                <div className="font-bold text-primary pt-2">
                    <p>इस पुनीत कार्य में सहयोग करें व अधिक जानकारी के लिए हमसे सम्पर्क करें।</p>
                    <p>Website : shreeramnaambank.com / Email : raamnaambank@gmail.com</p>
                    <p>Mob: 9045000108 / 8868888601 / 9410110900 / 8267006782</p>
                </div>
            </div>
        ),
    },
    {
        slug: "ganga-pollution-free",
        title: "8. गंगा प्रदूषण मुक्ति अभियान",
        image: ganga_campaign,
        desc: (
            <div className="space-y-4 text-justify text-lg leading-relaxed text-muted-foreground font-hind">
                <p>
                    श्रीराम नाम शिव बैंक समिति शुरू से अभी तक लगातार गंगा प्रदूषण मुक्ति जनजागरण अभियान चलाती आ रही है। गंगा जी की को प्रदूषण मुक्त बनाने के लिए संस्था ने केन्द्र की मोदी सरकार को वर्ष 2014 में कुछ प्रस्ताव भेजे थे जोकि केन्द्र सरकार ने मानकर उन्हें गंग प्रदुषण मुक्ति के मिशन में शामिल किया। जिसके फलस्वरूप गंगा जी को प्रदूषण मुक्त बनाने में काफी हद तक सहायता मिली।
                </p>
                <p>
                    अभी भी संस्था का प्रयास लगातार जारी है। कि लोगों को जागरुकता के माध्यम से इस अभियान से जोड़ा जाए। संस्था गंगा किनारे जगह-जगह कैम्प लगाकर लोगों को जागरुक करने का कार्य करती है। आप भी स्वयंसेवी बनकर हमारी इस मुहीम में शामिल होकर गंगा के प्रति अपनी जिम्मेदारी निभा सकते हैं।
                </p>
                <div className="font-bold text-primary pt-2">
                    <p>इस पुनीत कार्य में सहयोग करें व अधिक जानकारी के लिए हमसे सम्पर्क करें।</p>
                    <p>Website : shreeramnaambank.com / Email : raamnaambank@gmail.com</p>
                    <p>Mob: 9045000108 / 8868888601 / 9410110900 / 8267006782</p>
                </div>
            </div>
        ),
    },
    {
        slug: "medical-camp",
        title: "9. मेडिकल कैम्प (स्वास्थ शिविर)",
        image: medical_camp,
        desc: (
            <div className="space-y-4 text-justify text-lg leading-relaxed text-muted-foreground font-hind">
                <p>
                    श्रीराम नाम विश्व बैंक समिति समय-समय पर जरूरतमंद लोगों के लिए स्वास्थय शिविर या रक्तदान शिविर का आयोजन करती है। संख्या अपने ऐसे ही प्रयासों से अब तक बहुत से लोगों की जान बचा चुकी है। जिन्हें अस्पताल जाकर प्लेटलेट्‌स और खून देकर उन्हे मौत के मुंह से बाहर निकालने में मदद की।
                </p>
                <p>
                    संख्या अपने स्वयंसेवियों के सहयोग से वृहद स्तर पर अभियान चलाकर जरूरतमंदो को स्वास्थ्य से जुडी सामग्री भी वितरित करती है। इस महान कार्य से जुड़‌कर आप भी किसी की जान बचा सकते हैं। तो आइए हमारे साथ और इस कार्य में सहयोग कीजिए।
                </p>
                <div className="font-bold text-primary pt-2">
                    <p>इस पुनीत कार्य में सहयोग करें व अधिक जानकारी के लिए हमसे सम्पर्क करें।</p>
                    <p>Website : shreeramnaambank.com / Email : raamnaambank@gmail.com</p>
                    <p>Mob: 9045000108 / 8868888601 / 9410110900 / 8267006782</p>
                </div>
            </div>
        ),
    },
    {
        slug: "moksha-dham",
        title: "10. मोक्ष धाम (श्मशान घाट)",
        image: moksha_dham,
        desc: (
            <div className="space-y-4 text-justify text-lg leading-relaxed text-muted-foreground font-hind">
                <p>
                    जीवन से लेकर मृत्यु तक एक ही नाम कहा जाता है कि "राम नाम सत्य है" लेकिन अपने पूरे जीवनकाल में बहुत ही कम लोग है जो इस बात का अनुसरण करते है। हो सकता है उन कम लोगों में आप भी हो लेकिन मनुष्य सारा जीवन व्यर्थ के कार्यों में लगा देता है लेकिन जब अंत समय आता है या अंतिम समय बिस्तर में लेटे हुए मनुष्य सोचता है कि मैने अपने पूरे जीवन क्या किया ? क्या कमाया ? जो कमाया है उसका लाभ मुझे कुछ मिलेगा ? मेरे साथ कुछ जाएगा ? मैने पूरे जीवन अपने लोगों के लिए किया लेकिन अब मेरे जाने के बाद क्या होगा ? आदि ऐसे अनेक प्रकार से मनुष्य को सिर्फ पछतावा ही हासिल होता है। यदि वह अपने जीने से लेकर मरने तक यदि "राम नाम" का अनुसरण करता तो वह सद्गति को प्राप्त होता।
                </p>
                <p>
                    इसलिए जीवन से लेकर मृत्यु के सफर तक "श्री राम नाम ही सत्य है।" इसलिए राम नाम से जुड़कर अपना लोक एवं परलोक सुधारने का कार्य करें।
                </p>
                <p>
                    श्री राम नाम विश्व बैंक समिति इसी के साथ एक मोक्ष धाम (श्मशान घाट) संचालित करने का भी कार्य करती है। जिसमें गरीब, बेसहारा, निराश्रित, लावारिस या संस्था से जुड़े हुए स्वयंसेवियों का जीवन के उपरान्त पूरे विधि विधान से अंतिम संस्कार करने में भी सहयोग करती है। ताकि उन्हें भी श्री राम जी के चरणों में मोक्ष की प्राप्ति हो सके।
                </p>
                <p className="font-semibold text-primary">"आओ चलें काम से राम की ओर"...</p>
                <p>
                    गरीबों की सहायता, सेवा करने में यदि आप भी आगे आना चाहते है या सहयोग करना चाहते है तो आपका हृदय से स्वागत है।
                </p>
                <div className="font-bold text-primary pt-2">
                    <p>इस पुनीत कार्य में सहयोग करें व अधिक जानकारी के लिए हमसे सम्पर्क करें।</p>
                    <p>Website : shreeramnaambank.com / Email : raamnaambank@gmail.com</p>
                    <p>Mob: 9045000108 / 8868888601 / 9410110900 / 8267006782</p>
                </div>
            </div>
        ),
    },
];
